[
    {
        "project": "Amazon Alexa",
        "description": "Alexa Skills Kit is the environment for creating skills through Alexa. Skills are like apps, and they allow you customize your experience with Alexa.",
        "tools": ["React"],
        "img": "AmazonAlexa.png",
        "url": "https://developer.amazon.com/en-US/alexa/alexa-skills-kit?",
        "code": ""
    },
    {
        "project": "Amazon Brand Services",
        "description": "brandservices.amazon.com showcases the various services that Amazon sellers can take advantage of while selling their products through Amazon. This website is deployed in 18 different countries and has multilanguage support based on the user's locale.",
        "tools": ["React", "SCSS"],
        "img": "BrandServices.png",
        "url": "https://brandservices.amazon.com/?ref=Rzw4JkZ2NXIBhAe90EUIqVpst9",
        "code": ""
    },
    {
        "project": "M2 Information Systems",
        "description": "I was previously on the team recreating the current Microblogging MD app in React Native. The app features secure messaging for hospital employees, clinical alerts, access to callboards, patient lists, and more.",
        "tools": ["React Native"],
        "img": "M2Portfolio.png",
        "url": "https://www.m2is.com/",
        "code": ""
    },
    {
        "project": "Red Twig Café",
        "description": "Red Twig is a local cafe whose website I made from the ground up at Qudo Creative. This site includes access to a CMS for the customer to easily change the menu or other aspects of the website at ease. I also contributed to the design of the menu and about page.",
        "tools": ["Vue.js", "SCSS", "Bootstrap"],
        "img": "RedTwigPortfolio.png",
        "url": "https://www.redtwig.com/#/",
        "code": ""
    },
    {
        "project": "SRG Photo and Video",
        "description": "Photography portfolio website displaying the work of Savanna Grunzke. This site is made using the new Svelte framework and uses the Photo CMS app to update photos.",
        "tools": ["Svelte.js", "SCSS"],
        "img": "srgphotosv3.png",
        "url": "https://srgphoto.video/",
        "code": "https://github.com/James-revans/Photography-site"
    },
    {
        "project": "Photo CMS",
        "description": "CMS for uploading photos to your website. Built using React with Redux on the front end, and Node with Express on the backend, this app utilizes passport and jwt authentication to create user accounts and update their photo albums to be used in their websites. Endpoints are provided to retrieve the image urls once uploaded. Demo user credentials: email: test@email.com password: password1!",
        "tools": ["React", "Redux", "SCSS", "Node", "Express", "MongoDB"],
        "img": "photocmsv2.png",
        "url": "https://photo-cms.netlify.com/",
        "code": "https://github.com/James-revans/Photo-cms-front"
    },
    {
        "project": "Qudo Creative Landing Page",
        "description": "Interim landing page for Qudo Creative Creative Agency built in Svelte.",
        "tools": ["Svelte", "SCSS"],
        "img": "QudoCreative.png",
        "url": "https://qudocreative.io/",
        "code": ""
    }
]
